In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

/home/ubuntu/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/ubuntu/anaconda3/lib/python3.6/site-packages/matplotlib/font_manager.py:278: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  'Matplotlib is building the font cache using fc-list. '
/home/ubuntu/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/ubuntu/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

# read files and explore:

In [3]:
train_sales=pd.read_csv('data/sales_train.csv.gz')
train_sales.head(20)

          date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0   02.01.2013               0       59    22154      999.00           1.0
1   03.01.2013               0       25     2552      899.00           1.0
2   05.01.2013               0       25     2552      899.00          -1.0
3   06.01.2013               0       25     2554     1709.05           1.0
4   15.01.2013               0       25     2555     1099.00           1.0
5   10.01.2013               0       25     2564      349.00           1.0
6   02.01.2013               0       25     2565      549.00           1.0
7   04.01.2013               0       25     2572      239.00           1.0
8   11.01.2013               0       25     2572      299.00           1.0
9   03.01.2013               0       25     2573      299.00           3.0
10  03.01.2013               0       25     2574      399.00           2.0
11  05.01.2013               0       25     2574      399.00           1.0
12  07.01.2013               0       25     2574      399.00           1.0
13  08.01.2013               0       25     2574      399.00           2.0
14  10.01.2013               0       25     2574      399.00           1.0
15  11.01.2013               0       25     2574      399.00           2.0
16  13.01.2013               0       25     2574      399.00           1.0
17  16.01.2013               0       25     2574      399.00           1.0
18  26.01.2013               0       25     2574      399.00           1.0
19  27.01.2013               0       25     2574      399.00           1.0

In [6]:
test_sales=pd.read_csv('data/test.csv.gz')
test_sales.head(10)

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268
5   5        5     5039
6   6        5     5041
7   7        5     5046
8   8        5     5319
9   9        5     5003

In [7]:
print("train shape",train_sales.shape)
print("test shape",test_sales.shape)

train shape (2935849, 6)
test shape (214200, 3)

In [8]:
items=pd.read_csv('data/items.csv')
shops=pd.read_csv('data/shops.csv')
category_item=pd.read_csv('data/item_categories.csv')

In [16]:
print(items.shape)
items.head(10)

(22170, 3)

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40
5,***НОВЫЕ АМЕРИКАНСКИЕ ГРАФФИТИ (UNI) ...,5,40
6,***УДАР ПО ВОРОТАМ (UNI) D,6,40
7,***УДАР ПО ВОРОТАМ-2 (UNI) D,7,40
8,***ЧАЙ С МУССОЛИНИ D,8,40
9,***ШУГАРЛЭНДСКИЙ ЭКСПРЕСС (UNI) D,9,40

In [14]:
print(category_item.shape)
print(category_item.head(10))

(84, 2)
        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4
5      Аксессуары - PSVita                 5
6    Аксессуары - XBOX 360                 6
7    Аксессуары - XBOX ONE                 7
8           Билеты (Цифра)                 8
9          Доставка товара                 9

In [18]:
print(shops.shape)
shops.head(10)

(60, 2)

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4
5          Вологда ТРЦ "Мармелад"        5
6      Воронеж (Плехановская, 13)        6
7          Воронеж ТРЦ "Максимир"        7
8    Воронеж ТРЦ Сити-Парк "Град"        8
9               Выездная Торговля        9

In [25]:
train_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 6 columns):
date              object
date_block_num    int64
shop_id           int64
item_id           int64
item_price        float64
item_cnt_day      float64
dtypes: float64(2), int64(3), object(1)
memory usage: 134.4+ MB

# aggregate item count by month:

In [57]:
# How many entries are there for each month?
train_sales.groupby("date_block_num")["date_block_num"].count()

date_block_num
0     115690
1     108613
2     121347
3      94109
4      91759
5     100403
6     100548
7     104772
8      96137
9      94202
10     96736
11    143246
12     99349
13     89830
14     92733
15     77906
16     78529
17     82408
18     78760
19     86614
20     73157
21     79361
22     86428
23    130786
24     88522
25     71808
26     69977
27     56274
28     54548
29     54617
30     55549
31     57029
32     50588
33     53514
Name: date_block_num, dtype: int64

In [58]:
# Get the sum of items sold per month
clean_train_sales.groupby(['date_block_num'])["item_cnt_day"].sum()

date_block_num
0     131850.0
1     128382.0
2     147438.0
3     107439.0
4     107148.0
5     125583.0
6     117165.0
7     125586.0
8     133551.0
9     127815.0
10    130270.0
11    183670.0
12    117243.0
13    109975.0
14    115501.0
15     96744.0
16     97938.0
17     97623.0
18     91505.0
19    102910.0
20     99427.0
21    107623.0
22    118050.0
23    169055.0
24    111299.0
25     84419.0
26     82233.0
27     77948.0
28     72435.0
29     64237.0
30     63316.0
31     66196.0
32     72989.0
33     71184.0
Name: item_cnt_day, dtype: float64

In [46]:
clean_train_sales=train_sales[train_sales.item_cnt_day>0]

In [70]:
final_train_sales=clean_train_sales.groupby(["date_block_num","shop_id","item_id"], as_index=False)[["item_cnt_day"]].sum()
final_train_sales.head(10)

   date_block_num  shop_id  item_id  item_cnt_day
0               0        0       32           6.0
1               0        0       33           3.0
2               0        0       35           1.0
3               0        0       43           1.0
4               0        0       51           2.0
5               0        0       61           1.0
6               0        0       75           1.0
7               0        0       88           1.0
8               0        0       95           1.0
9               0        0       96           1.0

# aggregate item count per month

In [84]:
final_train=clean_train_sales.groupby(["date_block_num","shop_id","item_id"], as_index=False).agg({'item_cnt_day':'sum','item_price':'mean'})

In [88]:
final_train.columns=final_train.columns.str.replace("item_cnt_day","item_cnt_month")

In [89]:
print(final_train.shape)
final_train.head()

(1608226, 5)

   date_block_num  shop_id  item_id  item_cnt_month  item_price
0               0        0       32             6.0       221.0
1               0        0       33             3.0       347.0
2               0        0       35             1.0       247.0
3               0        0       43             1.0       221.0
4               0        0       51             2.0       128.5

In [42]:
test_sales.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [92]:
train_sales.tail()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
2935844,10.10.2015,33,25,7409,299.0,1.0
2935845,09.10.2015,33,25,7460,299.0,1.0
2935846,14.10.2015,33,25,7459,349.0,1.0
2935847,22.10.2015,33,25,7440,299.0,1.0
2935848,03.10.2015,33,25,7460,299.0,1.0

In [98]:
final_train=final_train[['date_block_num','shop_id','item_id','item_cnt_month']]

In [100]:
train_set=final_train[final_train.date_block_num<32]
validation_set=final_train[final_train.date_block_num>=32]

In [110]:
train_x=train_set[['shop_id','item_id']]
train_y=train_set['item_cnt_month']
val_x=validation_set[['shop_id','item_id']]
val_y=validation_set['item_cnt_month']

In [112]:
from sklearn.ensemble import RandomForestRegressor
rf_regr = RandomForestRegressor(random_state=0, n_estimators=400)
rf_regr.fit(train_x,train_y)

/home/ubuntu/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/ubuntu/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=400, n_jobs=1,
           oob_score=False, random_state=0, verbose=0, warm_start=False)

In [113]:
preds=rf_regr.predict(val_x)

In [121]:
from sklearn.metrics import mean_squared_error
np.sqrt(mean_squared_error(val_y, np.rint(preds)))

15.767620438167514

# train on the whole data:

In [131]:
X=final_train[['shop_id','item_id']]
y=final_train['item_cnt_month']

In [133]:
rf_regr = RandomForestRegressor(random_state=0, n_estimators=200,n_jobs=-1)
rf_regr.fit(X,y)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=200, n_jobs=-1,
           oob_score=False, random_state=0, verbose=0, warm_start=False)

In [135]:
test_sales.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [136]:
preds=rf_regr.predict(test_sales[['shop_id','item_id']])

In [142]:
np.rint(preds)

array([1., 6., 2., ..., 1., 1., 2.])

In [140]:
np.arange(0,len(preds))

array([     0,      1,      2, ..., 214197, 214198, 214199])

In [143]:
result=pd.DataFrame({'ID':test_sales['ID'],'item_cnt_month':np.rint(preds)})
result.to_csv('result.csv',index=False)